Revit 2027 API
TriangulationInterfaceForTriangulatedShellComponent Constructor
 Constructs an interface object for a TriangulatedShellComponent.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TriangulationInterfaceForTriangulatedShellComponent(
	TriangulatedShellComponent externalTriangulatedShellComponent
)
Public Sub New (
	externalTriangulatedShellComponent As TriangulatedShellComponent
)
public:
TriangulationInterfaceForTriangulatedShellComponent(
	TriangulatedShellComponent^ externalTriangulatedShellComponent
)
new :
        externalTriangulatedShellComponent : TriangulatedShellComponent -> TriangulationInterfaceForTriangulatedShellComponent
Parameters
externalTriangulatedShellComponent TriangulatedShellComponent
 The TriangulatedShellComponent that the interface object represents.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
TriangulationInterfaceForTriangulatedShellComponent Class
Autodesk.Revit.DB Namespace